<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Aide</title>
<link href="styles/doc.css" rel="stylesheet" type="text/css">
</head>
<body><div class="body" id="up">
<h1>Sommaire</h1>
<ol>
<li><a href="#id2779868" title="allez &agrave; ...">Qu'est-ce que FileX ?</a></li>
<li>
<a href="#id2781419" title="allez &agrave; ...">D&eacute;poser un fichier</a><ol><li><a href="#id2781471" title="allez &agrave; ...">Les options de d&eacute;pose</a></li></ol>
</li>
<li>
<a href="#id2781560" title="allez &agrave; ...">Gestion de vos fichiers</a><ol><li><a href="#id2781608" title="allez &agrave; ...">Modification des options de vos fichiers</a></li></ol>
</li>
<li><a href="#id2781754" title="allez &agrave; ...">Auteurs</a></li>
<li>
<a href="#id2781769" title="allez &agrave; ...">FAQ</a><ol>
<li><a href="#id2781774" title="allez &agrave; ...">Je veux d&eacute;poser plusieurs fichiers</a></li>
<li><a href="#id2781793" title="allez &agrave; ...">Je ne vois pas la fen&ecirc;tre de progression de d&eacute;pose de fichier</a></li>
<li><a href="#id2781839" title="allez &agrave; ...">Je ne me rappel plus de l'adresse de t&eacute;l&eacute;chargement de mon fichier</a></li>
</ol>
</li>
</ol>
<hr>
<h1 id="id2779868">1 Qu'est-ce que FileX ?</h1>

<p>
FileX est un syst&egrave;me de transfert de fichier.
</p>
<p>
Il &agrave; &eacute;t&eacute; con&ccedil;u dans le but de d&eacute;charger la messagerie &eacute;lectronique de cette t&acirc;che. En effet, nombre d'utilisateurs de messagerie utilisent la fonctionnalit&eacute; des "pi&egrave;ces jointes" pour transmettre des documents volumineux, ce qui occasionne quelques d&eacute;sagr&eacute;ments pour les destinataires :
</p>
<ul>
<li>Bo&icirc;te de mail satur&eacute;e
</li>
<li>Impossibilit&eacute; de recevoir les messages s'ils sont trop volumineux
</li>
<li>Lenteur de r&eacute;ception des mails
</li>
</ul>
<p>
Le principe de fonctionnement du syst&egrave;me est le suivant :
</p>
<ul>
<li>Vous d&eacute;pos&eacute; un fichier
</li>
<li>Une adresse internet identifiant le fichier est cr&eacute;&eacute;e
</li>
<li>Vous envoyez cette adresse par email au(x) destinataire(s) du fichier
</li>
<li>Le(s) destinataire(s) r&eacute;cup&egrave;re(nt) le fichier en utilisant leur navigateur internet
</li>
</ul>
<p>
Le seul outil n&eacute;cessaire pour effectuer toutes ces op&eacute;rations est le navigateur internet !
</p>
<a href="#up" title="Retour en haut de page" class="linkup">[haut]</a>
<h1 id="id2781419">2 D&eacute;poser un fichier</h1>

<p>
Pour d&eacute;poser un fichier : s&eacute;lectionner un fichier depuis votre disque dur en utilisant le bouton <em>parcourir...</em>, et appuyez sur le bouton <em>envoyer</em>.
</p>
<p>
Une fen&ecirc;tre indiquant la  progression du chargement du fichier sur le serveur appara&icirc;tra.
</p>
<p>
Il est possible que cette fen&ecirc;tre ne soit pas visible, selon la taille du fichier d&eacute;pos&eacute; ou le navigateur utilis&eacute;.
</p>
<p>
Lorsque la d&eacute;pose est termin&eacute;e, un message vous indiquera l'adresse &agrave; laquelle le fichier pourra &ecirc;tre t&eacute;l&eacute;charg&eacute; durant sa p&eacute;riode de validit&eacute;. Vous recevrez &eacute;galement une confirmation de d&eacute;pose de fichier par courrier &eacute;lectronique.
</p>
<p>
Pour qu'une personne r&eacute;cup&egrave;re votre fichier, faite lui passer cette adresse par courrier &eacute;lectronique ou tout autre moyen de communication.
</p>
<h2 id="id2781471">2.1 Les options de d&eacute;pose</h2>

<p>
Les options suivantes sont disponibles lors de la d&eacute;pose d'un fichier :
</p>
<ul>
<li>
<span class="underline">Expiration du fichier</span>
<p>
Le fichier ne serra plus disponible au t&eacute;l&eacute;chargement apr&egrave;s le nombre de jour s&eacute;lectionn&eacute;.
</p>
</li>
<li>
<span class="underline">Recevoir un avis de r&eacute;ception &agrave; chaque t&eacute;l&eacute;chargement</span>
<p>
Recevoir un e-mail de confirmation &agrave; chaque t&eacute;l&eacute;chargement du fichier.
</p>
</li>
<li>
<span class="underline">Recevoir un r&eacute;capitulatif des t&eacute;l&eacute;chargements lorsque le fichier aura expir&eacute;</span>
<p>
Recevoir un e-mail d&eacute;taillant les t&eacute;l&eacute;chargements du fichier lorsque celui-ci arrivera &agrave; expiration.
</p>
</li>
<li>
<span class="underline">Utiliser un mot de passe pour le t&eacute;l&eacute;chargement</span>
<p>
Vous pouvez d&eacute;finir un mot de passe qui sera demand&eacute; &agrave; chaque t&eacute;l&eacute;chargement de votre fichier.
</p>
<p>
<strong>Pensez &agrave; faire parvenir le mot de passe aux personnes devant t&eacute;l&eacute;chager votre fichier.</strong>
</p>
</li>
</ul>
<p>
Toutes ces options sont modifiables ult&eacute;rieurement via la <em>Gestion de vos fichiers</em>.
</p>

<a href="#up" title="Retour en haut de page" class="linkup">[haut]</a>
<h1 id="id2781560">3 Gestion de vos fichiers</h1>

<p>
La <em>Gestion de vos fichiers</em> est accessible depuis la page de d&eacute;pose de fichier. Elle permet de consulter l'historique de tous les fichiers que vous avez d&eacute;pos&eacute; sur le syst&egrave;me et d'en modifier certaines options.
</p>
<p>
La liste de vos fichiers est tri&eacute;e par d&eacute;faut de mani&egrave;re d&eacute;croissante sur la date de d&eacute;pose (le fichier le plus r&eacute;cent en haut).
</p>
<p>
Vous pouvez trier la liste de vos fichiers en cliquant sur <strong>+</strong> (ordre croissant) et <strong>-</strong> (ordre d&eacute;croissant) dans les ent&ecirc;tes de colonne
</p>
<p>
Pour avoir des informations d&eacute;taill&eacute;es sur un fichier et modifier certaines options, cliquez sur le nom du fichier.
</p>
<h2 id="id2781608">3.1 Modification des options de vos fichiers</h2>

<p>
Les options suivantes sont modifiable si le fichier <strong>n'a pas expir&eacute;</strong> :
</p>
<ul>
<li>
<span class="underline">Mot de passe</span>
<p>
Cette option vous permet de d&eacute;finir (ou supprimer) un mot de passe pour le t&eacute;l&eacute;chargement de votre fichier.
S&eacute;lectionnez <strong>non</strong> pour ne pas avoir &agrave; utiliser de mot de passe pour t&eacute;l&eacute;charger votre fichier ou <strong>oui</strong> et saisissez un mot de passe dans le champ de droite; soit pour cr&eacute;er un nouveau mot de passe, ou mettre &agrave; jour un pr&eacute;c&eacute;demment d&eacute;fini.
</p>
<p>
<strong>N'oubliez pas de faire parvenir ce mot de passe aux personnes devant t&eacute;l&eacute;charger votre fichier</strong>
</p>
</li>
<li>
<span class="underline">Augmenter la dur&eacute;e de vie du fichier de</span>
<p>
Cette option, si elle est active ou si vous n'avez pas d&eacute;pass&eacute; le nombre de renouvellement permit, vous permet de prolonger la dur&eacute;e de vie de votre fichier de <strong>n</strong> jours.
</p>
</li>
<li>
<span class="underline">Expir&eacute;</span>
<p>
S&eacute;lectionnez <strong>non</strong> si vous voulez faire expirer le fichier. Il ne serra alors plus disponible au t&eacute;l&eacute;chargement et sera supprim&eacute; du syst&egrave;me. <strong>Cette action est d&eacute;finitive</strong>.
</p>
</li>
<li>
<span class="underline">Recevoir un message &agrave; chaque t&eacute;l&eacute;chargement</span>
<p>
S&eacute;lectionnez <strong>oui</strong> ou <strong>non</strong> pour recevoir ou ne plus recevoir l'e-mail de confirmation de t&eacute;l&eacute;chargement de fichier.
</p>
</li>
<li>
<span class="underline">Recevoir un r&eacute;capitulatif lorsque le fichier sera supprim&eacute;</span>
<p>
S&eacute;lectionnez <strong>oui</strong> ou <strong>non</strong> pour recevoir un e-mail d&eacute;taillant les t&eacute;l&eacute;chargements du fichier lorsque celui-ci arrivera &agrave; expiration.
</p>
</li>
</ul>
<p>
Cliquez sur le bouton <em>"Valider"</em> pour appliquer vos modifications.
</p>

<a href="#up" title="Retour en haut de page" class="linkup">[haut]</a>
<h1 id="id2781754">4 Auteurs</h1>

<p>
Cette application &agrave; &eacute;t&eacute; d&eacute;velopp&eacute;e pour les besoins du Centre de Ressource Informatiques de l'INSA de Lyon par Fabien CHAUDIER et Olivier FRANCO.
</p>
<a href="#up" title="Retour en haut de page" class="linkup">[haut]</a>
<h1 id="id2781769">5 FAQ</h1>

<h2 id="id2781774">5.1 Je veux d&eacute;poser plusieurs fichiers</h2>

<p>
Il n'est possible de d&eacute;pos&eacute; qu'un seul fichier &agrave; la fois, aussi, si vous d&eacute;sirez d&eacute;poser plusieurs fichiers qui doivent &ecirc;tre t&eacute;l&eacute;charg&eacute;s simultan&eacute;ment, regroupez les en utilisant des utilitaires tels que zip, rar ...
</p>

<h2 id="id2781793">5.2 Je ne vois pas la fen&ecirc;tre de progression de d&eacute;pose de fichier</h2>

<p>
Il y a deux possibilit&eacute;s &agrave; ce "probl&egrave;me" :
</p>
<ul>
<li>le chargement du fichier est trop rapide, la fen&ecirc;tre se ferme automatiquement lorsque le chargement est termin&eacute;.
</li>
<li>la fen&ecirc;tre de progression ne fonctionne que sur des navigateurs de g&eacute;n&eacute;ration sup&eacute;rieur &agrave; 4 pour Netscape et Internet Explorer, ainsi que opera, mozilla (et d&eacute;riv&eacute;s : phoenix, firebird, galeon ...), konqueror
</li>
</ul>
<p>
Quoi qu'il en soit, c'est le message de confirmation de d&eacute;pose de fichier qui vous indiquera que celui-ci est bien d&eacute;pos&eacute;.
</p>

<h2 id="id2781839">5.3 Je ne me rappel plus de l'adresse de t&eacute;l&eacute;chargement de mon fichier</h2>

<p>
Retournez sur la page de d&eacute;pose de fichier et suivez le lien <em>Gestion de vos fichiers</em>. Localisez votre fichier et cliquez sur son nom. Vous obtiendrez ainsi des informations concernant votre fichier ainsi que son adresse de t&eacute;l&eacute;chargement si celui-ci n'a pas expir&eacute;.
</p>

<a href="#up" title="Retour en haut de page" class="linkup">[haut]</a>
</div></body>
</html>
